article/spring-framework-request-parameters.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-22 Sat 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>几种获取 Spring Framework 控制器中请求参数的方法</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">几种获取 Spring Framework 控制器中请求参数的方法</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd1c9686">1. 请求参数</a></li>
<li><a href="#org9a322ef">2. URI 路径请求</a></li>
<li><a href="#org1dcd786">3. URI 的请求参数</a></li>
<li><a href="#org41debc8">4. GET 的 Query 字符串中的参数</a></li>
<li><a href="#orgbd78bc1">5. POST 请求体里面的 JSON 参数</a></li>
<li><a href="#org56e6c2c">6. HttpServletRequest 对象</a></li>
<li><a href="#orgb5e7b78">7. 请求头</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd1c9686" class="outline-2">
<h2 id="orgd1c9686"><span class="section-number-2">1</span> 请求参数</h2>
<div class="outline-text-2" id="text-1">
<p>
在 HTTP 请求中往往有多种请求参数，在 Spring Framework 中的请求参数都是放在如下
所示的包中
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">web</span>.<span style="color: #268bd2;">bind</span>.<span style="color: #268bd2;">annotation</span>.*;
</pre>
</div>

<p>
下面是处理几种常见请求的控制器的方法：
</p>
</div>
</div>

<div id="outline-container-org9a322ef" class="outline-2">
<h2 id="org9a322ef"><span class="section-number-2">2</span> URI 路径请求</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-text">GET /orders/121233
</pre>
</div>

<p>
上面是请求 orderId=121233 的订单的 RESTFul API。这里的请求参数位于 URL 的路径
上，可以使用如下代码片段获取参数的值
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@GetMapping</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"/orders/{orderId}"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #268bd2;">Order</span> <span style="color: #b58900;">getOrder</span><span style="color: #8d5649;">(</span><span style="color: #268bd2;">@PathVariable</span> <span style="color: #268bd2;">long</span> <span style="color: #6c71c4;">orderId</span><span style="color: #8d5649;">)</span> <span style="color: #8d5649;">{</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dcd786" class="outline-2">
<h2 id="org1dcd786"><span class="section-number-2">3</span> URI 的请求参数</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-text">GET /orders?status=ready
</pre>
</div>

<p>
上面是请求所有状态一个就绪的订单，可以使用如下代码片段获取请求参数的值
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@GetMapping</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"/orders"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #268bd2;">List</span><span style="color: #8d5649;">&lt;</span><span style="color: #268bd2;">Order</span><span style="color: #8d5649;">&gt;</span> <span style="color: #b58900;">getOrdersList</span><span style="color: #8d5649;">(</span>
    <span style="color: #268bd2;">@RequestParam</span><span style="color: #d8241f;">(</span>value=<span style="color: #2aa198;">"status"</span>, required=<span style="color: #268bd2;">false</span>, defaultValue=<span style="color: #2aa198;">"idle"</span><span style="color: #d8241f;">)</span> <span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">orderStatus</span><span style="color: #8d5649;">)</span> <span style="color: #8d5649;">{</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org41debc8" class="outline-2">
<h2 id="org41debc8"><span class="section-number-2">4</span> GET 的 Query 字符串中的参数</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-text">GET /orders?name=new&amp;total=10
</pre>
</div>

<p>
上面的 GET 请求中的 Query 字符串为 <code>name=new&amp;total=10</code> ，可以理解成一系列的键
值对，所以可以使用如下代码来将其转化成 Java 的 Map 对象
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@GetMapping</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"/orders"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #268bd2;">List</span><span style="color: #8d5649;">&lt;</span><span style="color: #268bd2;">Order</span><span style="color: #8d5649;">&gt;</span> <span style="color: #b58900;">getOrdersList</span><span style="color: #8d5649;">(</span><span style="color: #268bd2;">@RequestParam</span> <span style="color: #268bd2;">Map</span><span style="color: #d8241f;">&lt;</span><span style="color: #268bd2;">String</span>, <span style="color: #268bd2;">Object</span><span style="color: #d8241f;">&gt;</span> <span style="color: #6c71c4;">params</span><span style="color: #8d5649;">)</span> <span style="color: #8d5649;">{</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
使用 <code>@RequestParam</code> 的好处是可以直接在控制器中是 Map，而不需要使用额外转化成
Map 的冗余代码
</p>
</div>
</div>

<div id="outline-container-orgbd78bc1" class="outline-2">
<h2 id="orgbd78bc1"><span class="section-number-2">5</span> POST 请求体里面的 JSON 参数</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-text">POST /orders

#################### body ####################
{
  "name": "new",
  "total": 10
}
</pre>
</div>

<p>
上面的 POST 请求中使用了 JSON 字符串作为请求的消息体，可以使用如下的方式来获取
消息体中的参数
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@ResponseStatus</span><span style="color: #8d5649;">(</span><span style="color: #268bd2;">HttpStatus</span>.<span style="color: #268bd2;">CREATED</span><span style="color: #8d5649;">)</span>
<span style="color: #268bd2;">@PostMapping</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">"/orders"</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">public</span> <span style="color: #268bd2;">Order</span> <span style="color: #b58900;">postOrders</span><span style="color: #8d5649;">(</span><span style="color: #268bd2;">@RequestBody</span> <span style="color: #268bd2;">Map</span><span style="color: #d8241f;">&lt;</span><span style="color: #268bd2;">String</span>, <span style="color: #268bd2;">Object</span><span style="color: #d8241f;">&gt;</span> <span style="color: #6c71c4;">params</span><span style="color: #8d5649;">)</span> <span style="color: #8d5649;">{</span>

<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
当定义的 RequestBody 是一个 Map 数据结构后，直接可以将请求体中的 JSON 数据体构
造成 Java 的 params 对象
</p>
</div>
</div>

<div id="outline-container-org56e6c2c" class="outline-2">
<h2 id="org56e6c2c"><span class="section-number-2">6</span> HttpServletRequest 对象</h2>
<div class="outline-text-2" id="text-6">
<p>
有时候，我们希望直接获取到请求的对象实例，这样就可以调用
<code>request.getRequestURI()</code> 来动态获取请求的相对路径，实现动态响应请求，Spring
Framework 提供了一个有效的手段，那就是直接把 HttpServletRequest 对象作为对象传
入请求方法中
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">import</span> <span style="color: #268bd2;">javax</span>.<span style="color: #268bd2;">servlet</span>.<span style="color: #268bd2;">http</span>.<span style="color: #268bd2;">HttpServletRequest</span>;

<span style="color: #268bd2;">@RestController</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">ProxyOrderController</span> <span style="color: #8d5649;">{</span>
  <span style="color: #268bd2;">@GetMapping</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"/orders/**"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">Object</span> <span style="color: #b58900;">getOrders</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">HttpServletRequest</span> <span style="color: #6c71c4;">request</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>

  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5e7b78" class="outline-2">
<h2 id="orgb5e7b78"><span class="section-number-2">7</span> 请求头</h2>
<div class="outline-text-2" id="text-7">
<p>
获取所有的请求头
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #859900;">import</span> <span style="color: #268bd2;">org</span>.<span style="color: #268bd2;">springframework</span>.<span style="color: #268bd2;">http</span>.<span style="color: #268bd2;">HttpHeaders</span>;

<span style="color: #268bd2;">@RestController</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">ProxyOrderController</span> <span style="color: #8d5649;">{</span>
  <span style="color: #268bd2;">@GetMapping</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"/orders/**"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">Object</span> <span style="color: #b58900;">getOrders</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">@RequestHeader</span> <span style="color: #268bd2;">HttpHeaders</span> <span style="color: #6c71c4;">headers</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>

  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
获取特定的请求头
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #268bd2;">@RestController</span>
<span style="color: #859900;">public</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">ProxyOrderController</span> <span style="color: #8d5649;">{</span>
  <span style="color: #268bd2;">@GetMapping</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">"/orders/**"</span><span style="color: #d8241f;">)</span>
  <span style="color: #859900;">public</span> <span style="color: #268bd2;">Object</span> <span style="color: #b58900;">getOrders</span><span style="color: #d8241f;">(</span><span style="color: #268bd2;">@RequestHeader</span><span style="color: #9564bf;">(</span><span style="color: #2aa198;">"User-Agent"</span><span style="color: #9564bf;">)</span> <span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">ua</span><span style="color: #d8241f;">)</span> <span style="color: #d8241f;">{</span>

  <span style="color: #d8241f;">}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-02-22 Sat 19:24. Created by Jinghui Hu at 2019-11-19 Tue 21:29.</p>
</div>
</body>
</html>
